# coding=utf8
# Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ, выполнение программы завершается. Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

flag = True
sum = 0
def summa(s):
    global sum, flag
    arr = s.split()
    for i in range(len(arr)):
        if not arr[i].isdigit() and arr[i] == 'q':
            flag = False
            break
        else:
            sum += int(arr[i])

while flag:
    st = input('Введите последовательность чисел через пробел. Для выхода из программы нажмите q, для продолжения "Enter": ')
    summa(st)
    print(sum)