# coding=utf8
""" Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных, практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30} """

di = {}
with open('les5_task6.txt', encoding='utf-8') as f_obj:
    for line in f_obj:
        name, st = line.split(':')
        sum_ = sum(map(int, ''.join([i for i in st if i == ' ' or (i >= '0' and i <= '9')]).split()))
        di[name] = sum_
for key, value in di.items():
    print(f'{key} = {value}')



# import re
# li = []
# with open('les5_task6.txt', encoding='utf-8') as f_obj:
#     for i in f_obj.readlines():
#         #print(re.split(r'[\\(\)\:\n\.\-\']', i)) 
#         #li.append(re.split(r'\W+', i))
#     print(li)