""" Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2]. """

my_list = [7, 5, 3, 3, 2, 2]
print(f'"Рейтинг" {my_list}')
num = int(input('Введите новый элемент для структуры "Рейтинг": '))
for id_, item in enumerate(my_list):
    if num >= item and my_list.count(num) >= 1:
        my_list.insert(id_ +  my_list.count(num), num)
        break
    elif num >= item and my_list.count(num) == 0:
        my_list.insert(id_, num)
        break
    elif id_ == len(my_list)-1:
        my_list.append(num)
        break
print(f'"Рейтинг" {my_list}')