""" Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл. Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено. """
from itertools import count, cycle, repeat, combinations

for el in count(3):
    if el > 10:
        break
    else:
        print(el, end=' ')
print()
print('*'*30)
с = 0
lis = ['A','B','C','D','E']
for el in cycle(lis):
    if с > 14:
        break
    print(el, end=' ')
    с += 1
# *********************** метод repeat ************************** #
print()
print('*'*30)
my_list = ['A','B','C','D','E']
new_list = [i for i in repeat(my_list, 3)]
print(new_list)