# coding=utf8
""" * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара: название, цена, количество, единица измерения). Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}), 
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например название, а значение — список значений-характеристик, например список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
} """
import sys
n = 0
product = []
product_analyz = dict()
# product = [
#     (1, {'название': 'компьютер', 'цена': 20000, 'количество': 5, 'eд': 'шт.'}),
#     (2, {'название': 'принтер', 'цена': 6000, 'количество': 2, 'eд': 'шт.'}), 
#     (3, {'название': 'сканер', 'цена': 2000, 'количество': 7, 'eд': 'шт.'})
# ]
# ********************************** Меню *********************************** #
while True:
    print('0 - Выход из программы', 
          '1 - Cформировать (ввести) товар',
          '2 - Удалить товар',
          '3 - Изменить товар',
          '4 - Аналитика по "Товар"',  
          '5 - Вывести структуру "Товар"', sep='\n')
# ************************************************************************** #
    num_oper = int(input('Введите операцию: '))

# ********************************** Выход *********************************** #
    if num_oper == 0:
        print('До встречи!')
        break

# ********************************** Добавление *********************************** #
    elif num_oper == 1:
        n += 1
        span = {'название': input('Введите название товара: '), 'цена': int(input('Укажите стоимость товара: ')), 'количество': int(input('Количество товара на складе: ')), 'eд': 'шт.'}
        product.append((n, span))
        #product_analyz.setdefault(span.key(), span.value())

# ********************************** Удаление *********************************** #
    elif num_oper == 2:
        if len(product) == 0:
            print('Необходимо добавить хотя бы один товар')
            input('Для продолжения нажмите Enter.')
            continue

        for i in range(len(product)):
            print(product[i])
        number_good = int(input('Введите номер товара, который хотите удалить: '))
        for i, item in enumerate(product):
            if item[0] == number_good:
                product.pop(i)
        print('Товар усаешно удалён!')

# ********************************** Изменение *********************************** #
    elif num_oper == 3:
        if len(product) == 0:
            print('Необходимо добавить хотя бы один товар')
            input('Для продолжения нажмите Enter.')
            continue

        for i in range(len(product)):
            print(product[i])
        number_good = int(input('Введите номер товара, который хотите изменить: '))
        for i, item in enumerate(product):
            if item[0] == number_good:
                span = {'название': input('Введите название товара: '), 'цена': int(input('Укажите стоимость товара: ')), 'количество': int(input('Количество товара на складе: ')), 'eд': 'шт.'}
                product[i][1].update(span)
        print('Товар успешно изменён!')

# ********************************** Аналитика *********************************** #
    elif num_oper == 4:
        if len(product) == 0:
            print('Необходимо добавить хотя бы один товар')
            input('Для продолжения нажмите Enter.')
            continue

        lis = list(product[0][1].keys());
        for i in range(len(lis)):
            product_analyz.setdefault(lis[i], [])
        for key in product_analyz.keys():
            for i in range(len(product)):
                product_analyz[key].append(product[i][1].get(key))

        #     for key, value in enumerate(product[i][1].items()):
        #         product_analyz.setdefault(lis[i], []).append(value)

        # for i in range(len(product)):
        #     for value in enumerate(product[i][1].values()):
        #         product_analyz[i] = value
        #         product_analyz.setdefault(lis[i], []).append(value)
        #     for key, value in product[i][1].items():

        for key, value in product_analyz.items():
            print(f'{key}: {value}')
        lis.clear()
        product_analyz.clear()

# ********************************** Вывод *********************************** #
    elif num_oper == 5:
        if len(product) == 0:
            print('Нет данных для вывода!')
            input('Для продолжения нажмите Enter.')
            continue
        for i in range(len(product)):
            print(product[i])     