# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
def division(*argv):
    try:
        num1 = int(input('Введите первое число: '))
        num2 = int(input('Введите второе число: '))
        return num1/num2
    except ZeroDivisionError:
        return 'Ошибка деления на нуль'
    except ValueError:
        return 'Символ там, где ожидается число'
c = division()
print(c)