# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
l = [1, 2.1, 'Hello', True, (3, 4), [5, 6], {7, 8}, {9: 'Ivan', 10: 'Maria'}, None, b"text", complex(11, 12)]
for i in range(len(l)):
    print(type(l[i]))

# через генератор, но только вывод в строку    
#print([type(l[i]) for i in range(len(l))])