# Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.
month = int(input('Введите месяц в виде целого числа от 1 до 12: '))
l_month = ['зима', 'весна', 'лето', 'осень']    # Список с временами годаW
#for i in range(1, len(l_month), 2):
time_year = ''
d_month = {'зима': (1, 2, 12), 'весна': (3, 4, 5), 'лето': (6, 7, 8), 'осень': (9, 10, 11)}
"""******************** 1 вариант **********************"""
# for key, item in d_month.items():
#     for i in range(len(item)):
#         if item[i] == month:
#             print(f'Это {key}')
"""******************** 2 вариант через генераторы **********************"""
print(f'Это {[key for key, item in d_month.items() for i in range(len(item)) if item[i] == month]}')
print(d_month)