# coding=utf8
# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров. Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
a = int(input('С чего начнем? '))
b = int(input('К чему стремимся? '))
PROC = 10 # константа в рамках данной программы
#print(f'1-й день {a} км')
i = 2
while a < b:
    a += (a*PROC)/100
#    print(f'{i}-й день {a:.2f} км')
    i+=1
print(f'На {i-1}-й день ты достигнешь результата — не менее {b} км. GO!!!')