# coding=utf8
# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия. Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
from sys import argv

output_hours, rate_hour, premium = argv[1:]

print("Выработка в часах: ", output_hours)
print("Ставка в час: ", rate_hour)
print("Премия: ", premium)
print(f'Заработная плата сотрудника составляет {int(output_hours) * int(rate_hour) + int(premium)} руб.') 