# Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс. Используйте форматирование строк.
n = int(input("Введите время в секундах: "))
minutes = n // 60
hours = minutes // 60
print (f'чч:мм:сс = {hours:02d}:{minutes % 60:02d}:{n % 60:02d}')